In [40]:
import numpy as np
import pandas as pd

In [41]:
data=np.random.randn(4,3)

In [42]:
data

array([[ 1.18165846,  0.09646821, -0.03443456],
       [-0.19893493,  0.10223371, -0.76826073],
       [-0.20331572,  1.63812234,  0.00713884],
       [-1.38569989,  0.53848094,  0.57324021]])

In [43]:
dataFrame=pd.DataFrame(data)

In [44]:
dataFrame

          0         1         2
0  1.181658  0.096468 -0.034435
1 -0.198935  0.102234 -0.768261
2 -0.203316  1.638122  0.007139
3 -1.385700  0.538481  0.573240

In [45]:
dataFrame[0]

0    1.181658
1   -0.198935
2   -0.203316
3   -1.385700
Name: 0, dtype: float64

In [46]:
yeniDataFrame=pd.DataFrame(data,index=["atil","zeynep","atlas","mehmet"],
                           columns=["maas","yas","calisma saati"])

In [47]:
yeniDataFrame

            maas       yas  calisma saati
atil    1.181658  0.096468      -0.034435
zeynep -0.198935  0.102234      -0.768261
atlas  -0.203316  1.638122       0.007139
mehmet -1.385700  0.538481       0.573240

In [48]:
yeniDataFrame["yas"]

atil      0.096468
zeynep    0.102234
atlas     1.638122
mehmet    0.538481
Name: yas, dtype: float64

In [49]:
yeniDataFrame[["maas","yas"]]

            maas       yas
atil    1.181658  0.096468
zeynep -0.198935  0.102234
atlas  -0.203316  1.638122
mehmet -1.385700  0.538481

In [50]:
yeniDataFrame

            maas       yas  calisma saati
atil    1.181658  0.096468      -0.034435
zeynep -0.198935  0.102234      -0.768261
atlas  -0.203316  1.638122       0.007139
mehmet -1.385700  0.538481       0.573240

In [51]:
yeniDataFrame.loc["atil"]

maas             1.181658
yas              0.096468
calisma saati   -0.034435
Name: atil, dtype: float64

In [52]:
yeniDataFrame.loc[["atil","zeynep"]]

            maas       yas  calisma saati
atil    1.181658  0.096468      -0.034435
zeynep -0.198935  0.102234      -0.768261

In [53]:
yeniDataFrame.iloc[[0,2]]

           maas       yas  calisma saati
atil   1.181658  0.096468      -0.034435
atlas -0.203316  1.638122       0.007139

In [54]:
yeniDataFrame

            maas       yas  calisma saati
atil    1.181658  0.096468      -0.034435
zeynep -0.198935  0.102234      -0.768261
atlas  -0.203316  1.638122       0.007139
mehmet -1.385700  0.538481       0.573240

In [55]:
yeniDataFrame["maas"]

atil      1.181658
zeynep   -0.198935
atlas    -0.203316
mehmet   -1.385700
Name: maas, dtype: float64

In [56]:
yeniDataFrame["emeklilik yasi"]=yeniDataFrame["yas"]+yeniDataFrame["yas"]

In [57]:
yeniDataFrame

            maas       yas  calisma saati  emeklilik yasi
atil    1.181658  0.096468      -0.034435        0.192936
zeynep -0.198935  0.102234      -0.768261        0.204467
atlas  -0.203316  1.638122       0.007139        3.276245
mehmet -1.385700  0.538481       0.573240        1.076962

In [79]:
yeniDataFrame.drop("emeklilik yasi",axis=1)

            maas       yas  calisma saati
atil    1.181658  0.096468      -0.034435
zeynep -0.198935  0.102234      -0.768261
atlas  -0.203316  1.638122       0.007139
mehmet -1.385700  0.538481       0.573240

In [81]:
yeniDataFrame.drop("mehmet",axis=0)

            maas       yas  calisma saati  emeklilik yasi
atil    1.181658  0.096468      -0.034435        0.192936
zeynep -0.198935  0.102234      -0.768261        0.204467
atlas  -0.203316  1.638122       0.007139        3.276245

In [83]:
yeniDataFrame

            maas       yas  calisma saati  emeklilik yasi
atil    1.181658  0.096468      -0.034435        0.192936
zeynep -0.198935  0.102234      -0.768261        0.204467
atlas  -0.203316  1.638122       0.007139        3.276245
mehmet -1.385700  0.538481       0.573240        1.076962

In [85]:
yeniDataFrame.drop("emeklilik yasi",axis=1,inplace=True)

In [87]:
yeniDataFrame

            maas       yas  calisma saati
atil    1.181658  0.096468      -0.034435
zeynep -0.198935  0.102234      -0.768261
atlas  -0.203316  1.638122       0.007139
mehmet -1.385700  0.538481       0.573240

In [91]:
yeniDataFrame.loc["atil"]

maas             1.181658
yas              0.096468
calisma saati   -0.034435
Name: atil, dtype: float64

In [93]:
yeniDataFrame.loc["atil"]["calisma saati"]

-0.034434555332038305

In [97]:
yeniDataFrame.loc["atil","yas"]

0.09646820697834636

In [99]:
yeniDataFrame

            maas       yas  calisma saati
atil    1.181658  0.096468      -0.034435
zeynep -0.198935  0.102234      -0.768261
atlas  -0.203316  1.638122       0.007139
mehmet -1.385700  0.538481       0.573240

In [101]:
yeniDataFrame<0

         maas    yas  calisma saati
atil    False  False           True
zeynep   True  False           True
atlas    True  False          False
mehmet   True  False          False

In [103]:
booleanFrame=yeniDataFrame>0

In [105]:
yeniDataFrame[booleanFrame]

            maas       yas  calisma saati
atil    1.181658  0.096468            NaN
zeynep       NaN  0.102234            NaN
atlas        NaN  1.638122       0.007139
mehmet       NaN  0.538481       0.573240

In [109]:
yeniDataFrame[yeniDataFrame["calisma saati"]>0]

            maas       yas  calisma saati
atlas  -0.203316  1.638122       0.007139
mehmet -1.385700  0.538481       0.573240

In [113]:
yeniDataFrame[yeniDataFrame["maas"]>0]

          maas       yas  calisma saati
atil  1.181658  0.096468      -0.034435

In [115]:
yeniDataFrame.reset_index()

    index      maas       yas  calisma saati
0    atil  1.181658  0.096468      -0.034435
1  zeynep -0.198935  0.102234      -0.768261
2   atlas -0.203316  1.638122       0.007139
3  mehmet -1.385700  0.538481       0.573240

In [117]:
yeniDataFrame

            maas       yas  calisma saati
atil    1.181658  0.096468      -0.034435
zeynep -0.198935  0.102234      -0.768261
atlas  -0.203316  1.638122       0.007139
mehmet -1.385700  0.538481       0.573240

In [119]:
yeniIndexListesi=["ati","zey","atl","meh"]

In [121]:
yeniDataFrame["Yeni Index"]=yeniIndexListesi

In [123]:
yeniDataFrame

            maas       yas  calisma saati Yeni Index
atil    1.181658  0.096468      -0.034435        ati
zeynep -0.198935  0.102234      -0.768261        zey
atlas  -0.203316  1.638122       0.007139        atl
mehmet -1.385700  0.538481       0.573240        meh

In [125]:
yeniDataFrame.set_index("Yeni Index")

                maas       yas  calisma saati
Yeni Index
ati         1.181658  0.096468      -0.034435
zey        -0.198935  0.102234      -0.768261
atl        -0.203316  1.638122       0.007139
meh        -1.385700  0.538481       0.573240

In [127]:
yeniDataFrame

            maas       yas  calisma saati Yeni Index
atil    1.181658  0.096468      -0.034435        ati
zeynep -0.198935  0.102234      -0.768261        zey
atlas  -0.203316  1.638122       0.007139        atl
mehmet -1.385700  0.538481       0.573240        meh

In [129]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [131]:
yeniDataFrame

                maas       yas  calisma saati
Yeni Index
ati         1.181658  0.096468      -0.034435
zey        -0.198935  0.102234      -0.768261
atl        -0.203316  1.638122       0.007139
meh        -1.385700  0.538481       0.573240

In [133]:
yeniDataFrame.loc["ati"]

maas             1.181658
yas              0.096468
calisma saati   -0.034435
Name: ati, dtype: float64

In [135]:
ilkIndexler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [137]:
icIndexler=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [139]:
birlesmisIndex=list(zip(ilkIndexler,icIndexler))

In [141]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [143]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [145]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [147]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [149]:
benimCizgiFilmListem=[[40,"A"],[30,"B"],[20,"C"],[10,"D"],[50,"E"],[60,"F"]]

In [151]:
cizgiFilmNumpyDizisi=np.array(benimCizgiFilmListem)

In [153]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndex,columns=["Yas","Meslek"])

In [155]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     30      B
           Marge    20      C
South Park Cartman  10      D
           Kenny    50      E
           Kyle     60      F

In [157]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   30      B
Marge  20      C

In [159]:
cizgiFilmDataFrame.loc["Simpson"].loc["Marge"]

Yas       20
Meslek     C
Name: Marge, dtype: object

In [161]:
cizgiFilmDataFrame.index.names=["Film Adı","İsim"]

In [163]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     30      B
           Marge    20      C
South Park Cartman  10      D
           Kenny    50      E
           Kyle     60      F